html/tech/tips.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-30 四 08:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>一些小技巧</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="szc.buda" />
</head>
<body>
<div id="content">
<h1 class="title">一些小技巧</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org260d70b">代替_<sub>FILE</sub>_<sub>宏只显示文件名</sub></a>
<ul>
<li><a href="#org6a58040">在运行时去掉</a></li>
<li><a href="#org9a8ef56">在预编译去掉</a>
<ul>
<li><a href="#org9b30987">在makefile中</a></li>
<li><a href="#orgdea276b">在scons中</a></li>
<li><a href="#org4f14b84">cmake</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org260d70b" class="outline-2">
<h2 id="org260d70b">代替_<sub>FILE</sub>_<sub>宏只显示文件名</sub></h2>
<div class="outline-text-2" id="text-org260d70b">
<p>
<a href="https://stackoverflow.com/questions/8487986/file-macro-shows-full-path">参考</a>
</p>

<p>
在默认的情况下，_<sub>FILE</sub>__ 被替换成文件的完整路径名，
如
</p>
<pre class="example">
gcc -o app/src/module/proxy.c
</pre>

<p>
<span class="underline"><span class="underline">FILE</span></span> 值为 app/src/module/proxy.c
</p>

<p>
但如果在module目录下执行
</p>
<pre class="example">
gcc -o proxy.c
</pre>
<p>
<span class="underline"><span class="underline">FILE</span></span> 值为 proxy.c
</p>

<p>
在cmake ,scons等编译系统下，log长度就会很长，而我们只希望保留文件名即可
</p>
</div>

<div id="outline-container-org6a58040" class="outline-3">
<h3 id="org6a58040">在运行时去掉</h3>
<div class="outline-text-3" id="text-org6a58040">
<pre class="example">
#define __FILENAME__ (strrchr(__FILE__, '/') ? strrchr(__FILE__, '/') + 1 : __FILE__)
</pre>


<p>
在使用时就用_<sub>FILENAME</sub>_<sub>代替</sub>_<sub>FILE</sub>__
</p>
</div>
</div>

<div id="outline-container-org9a8ef56" class="outline-3">
<h3 id="org9a8ef56">在预编译去掉</h3>
<div class="outline-text-3" id="text-org9a8ef56">
</div>
<div id="outline-container-org9b30987" class="outline-4">
<h4 id="org9b30987">在makefile中</h4>
<div class="outline-text-4" id="text-org9b30987">
<p>
自己写的例子
</p>

<p>
c文件
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #F92672;">#define</span> <span style="color: #A6E22E;">BASIC_TRACE</span>(<span style="color: #FD971F;">level</span>, <span style="color: #FD971F;">format</span>, ...)                                  \
    <span style="color: #F92672;">do</span>{                                                                 \
        <span style="color: #F92672;">if</span>(level &lt;= 5){                                      \
            printf(<span style="color: #EEDC82;">"%s(%d): "</span>format<span style="color: #EEDC82;">"\n"</span>, __FILENAME__, __LINE__, ##__VA_ARGS__); \
        }                                                               \
    }<span style="color: #F92672;">while</span>(0)




<span style="color: #F92672;">#include</span> <span style="color: #EEDC82;">&lt;stdio.h&gt;</span>
<span style="color: #F92672;">#include</span> <span style="color: #EEDC82;">&lt;string.h&gt;</span>

<span style="color: #66D9EF;">void</span> <span style="color: #A6E22E;">main</span>(<span style="color: #66D9EF;">void</span>){

    BASIC_TRACE(1, <span style="color: #EEDC82;">"etette"</span>);
}


</pre>
</div>


<p>
makefile 
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #A6E22E;">all</span>: test
<span style="color: #A6E22E;">clean</span>:
    rm -f test.o test

<span style="color: #A6E22E;">test</span> : test.c
    gcc $<span style="color: #FF80F4;">&lt;</span> -D__FILENAME__=\"$(<span style="color: #FD971F;">notdir</span> $<span style="color: #FF80F4;">&lt;</span>)\" -o <span style="color: #A6E22E;">$</span><span style="color: #FF80F4;">@</span>

</pre>
</div>



<p>
进一步可以放在CFLAGS里
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #A6E22E;">all</span>: test

<span style="color: #A6E22E;">clean</span>:
    rm -f test.o test

<span style="color: #FD971F;">CFLAGS</span> = -D__FILENAME__=\"$(<span style="color: #FD971F;">notdir</span> $(<span style="color: #FD971F;">abspath</span> $<span style="color: #FF80F4;">&lt;</span>))\"
<span style="color: #8C8C8C;">#</span><span style="color: #8C8C8C;">CFLAGS = -D__FILENAME__=\"$(</span><span style="color: #FD971F;">notdir</span><span style="color: #8C8C8C;"> $</span><span style="color: #FF80F4;">&lt;</span><span style="color: #8C8C8C;">)\"</span>

<span style="color: #A6E22E;">test</span> : test.c
    gcc $<span style="color: #FF80F4;">&lt;</span> ${<span style="color: #FD971F;">CFLAGS</span>} -o <span style="color: #A6E22E;">$</span><span style="color: #FF80F4;">@</span>
</pre>
</div>


<p>
这里用到了make的notdir函数，作用是去掉路径部分.
abspath不是必须的，只是为了说明notdir函数
</p>
</div>
</div>
<div id="outline-container-orgdea276b" class="outline-4">
<h4 id="orgdea276b">在scons中</h4>
<div class="outline-text-4" id="text-orgdea276b">
<p>
scons中可以设置编译的命令行，$CCCOM,
以在rt-thread项目为例，
在bsp/stm32f20x/SConstruct文件中，
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F92672;">if</span> <span style="color: #DEDEDE; background-color: #161A1F;">rtconfig.PLATFORM</span> == <span style="color: #EEDC82;">'gcc'</span>:
    env.Replace(<span style="color: #DEDEDE; background-color: #161A1F;">CCCOM</span> = [<span style="color: #EEDC82;">'basename $SOURCES | xargs -i{} $CC -o $TARGET -c -D__FILENAME__=\\\"{}\\\" $CFLAGS $CCFLAGS $_CCCOMCOM $SOURCES'</span>])
</pre>
</div>

<p>
先用basename 命令去除多余部分，然后传给$CC， 定义一个宏。
注意这是用的是两次转义操作，因为要在python和bash各转一次。
</p>
</div>
</div>

<div id="outline-container-org4f14b84" class="outline-4">
<h4 id="org4f14b84">cmake</h4>
<div class="outline-text-4" id="text-org4f14b84">
<p>
If you are using CMAKE with GNU compiler this global define works fine
</p>
<pre class="example">
set(CMAKE_CXX_FLAGS "${CMAKE_CXX_FLAGS} -D__MY_FILE__='\"$(notdir $(abspath $&lt;))\"'")
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: szc.buda</p>
<p class="date">Created: 2017-11-30 四 08:55</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
